BibleBrailleComp/test/Test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bib="http://j2ee.netbeans.org/wsdl/BibleBraille/src/BibleBrailleWSDL">
  <soapenv:Body>
    <bib:BibleBrailleWSDLOperation>
      <book>exodus</book>
      <chapter>2</chapter>
      <verse>2</verse>
    </bib:BibleBrailleWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>